In [254]:
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt

import pandas as pd
import numpy as np
import warnings
warnings.filterwarnings('ignore')

In [255]:
# Import data
df=pd.read_csv('data/Train.csv')
df.head(3)

,ID,country,age_group,travel_with,total_female,total_male,purpose,main_activity,info_source,tour_arrangement,...,package_transport_tz,package_sightseeing,package_guided_tour,package_insurance,night_mainland,night_zanzibar,payment_mode,first_trip_tz,most_impressing,total_cost
0,tour_0,SWIZERLAND,45-64,Friends/Relatives,1.0,1.0,Leisure and Holidays,Wildlife tourism,"Friends, relatives",Independent,...,No,No,No,No,13.0,0.0,Cash,No,Friendly People,674602.5
1,tour_10,UNITED KINGDOM,25-44,NaN,1.0,0.0,Leisure and Holidays,Cultural tourism,others,Independent,...,No,No,No,No,14.0,7.0,Cash,Yes,"Wonderful Country, Landscape, Nature",3214906.5
2,tour_1000,UNITED KINGDOM,25-44,Alone,0.0,1.0,Visiting Friends and Relatives,Cultural tourism,"Friends, relatives",Independent,...,No,No,No,No,1.0,31.0,Cash,No,Excellent Experience,3315000.0

In [256]:
df.shape

(4809, 23)

# Data cleaning

In [257]:
# Check data info and show the data type of each column
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4809 entries, 0 to 4808
Data columns (total 23 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   ID                     4809 non-null   object
 1   country                4809 non-null   object
 2   age_group              4809 non-null   object
 3   travel_with            3695 non-null   object
 4   total_female           4806 non-null   float64
 5   total_male             4804 non-null   float64
 6   purpose                4809 non-null   object
 7   main_activity          4809 non-null   object
 8   info_source            4809 non-null   object
 9   tour_arrangement       4809 non-null   object
 10  package_transport_int  4809 non-null   object
 11  package_accomodation   4809 non-null   object
 12  package_food           4809 non-null   object
 13  package_transport_tz   4809 non-null   object
 14  package_sightseeing    4809 non-null   object
 15  package_guided_tour    4809 non-null   object
 16  package_insurance      4809 non-null   object
 17  night_mainland         4809 non-null   float64
 18  night_zanzibar         4809 non-null   float64
 19  payment_mode           4809 non-null   object
 20  first_trip_tz          4809 non-null   object
 21  most_impressing        4496 non-null   object
 22  total_cost             4809 non-null   float64
dtypes: float64(5), object(18)
memory usage: 864.2+ KB

In [258]:
# select numeric columns
df.select_dtypes('number')

      total_female  total_male  night_mainland  night_zanzibar  total_cost
0              1.0         1.0            13.0             0.0    674602.5
1              1.0         0.0            14.0             7.0   3214906.5
2              0.0         1.0             1.0            31.0   3315000.0
3              1.0         1.0            11.0             0.0   7790250.0
4              1.0         0.0             7.0             4.0   1657500.0
...            ...         ...             ...             ...         ...
4804           0.0         1.0             2.0             0.0   3315000.0
4805           1.0         1.0            11.0             0.0  10690875.0
4806           1.0         0.0             3.0             7.0   2246636.7
4807           1.0         1.0             5.0             0.0   1160250.0
4808           1.0         1.0             4.0             7.0  13260000.0

[4809 rows x 5 columns]

In [259]:
# check how many duplicated rows exist in the data frame
df.duplicated().value_counts()

False    4809
dtype: int64

In the following we will take care about this missing data.

In [260]:
# display number of missing values per column
df.isna().sum()

ID                          0
country                     0
age_group                   0
travel_with              1114
total_female                3
total_male                  5
purpose                     0
main_activity               0
info_source                 0
tour_arrangement            0
package_transport_int       0
package_accomodation        0
package_food                0
package_transport_tz        0
package_sightseeing         0
package_guided_tour         0
package_insurance           0
night_mainland              0
night_zanzibar              0
payment_mode                0
first_trip_tz               0
most_impressing           313
total_cost                  0
dtype: int64

In [261]:
print(f"numbers of rows : {df.shape[0]}")
print(f"missing values in travel with : {round(df.travel_with.isna().sum()/df.shape[0]*100,2)} %")
print(f"missing values in total_female : {round(df.total_female.isna().sum()/df.shape[0]*100,2)} %")
print(f"missing values in total_male : {round(df.total_male.isna().sum()/df.shape[0]*100,2)} %")
print(f"missing values in most_impressing : {round(df.most_impressing.isna().sum().sum()/(df.shape[0]*df.shape[1])*100,2)} %")

numbers of rows : 4809
missing values in travel with : 23.16 %
missing values in total_female : 0.06 %
missing values in total_male : 0.1 %
missing values in most_impressing : 0.28 %

In [262]:
'''get 12 countries that spent more in Tanzania Tourisim.
'''
df_new = df[df.country.isin(["CHINA","DENMARK","SWIZERLAND","UNITED STATES OF AMERICA", "UNITED KINGDOM","ITALY","FRANCE","AUSTRALIA","SOUTH AFRICA","GERMANY","SPAIN","CANADA","NETHERLANDS"])]

In [263]:
df_new.shape

(3106, 23)

In [264]:
'''by removing the rest of the counries that do not have much influances on total cost we also got rid of some of the data that were already missing.
'''

df_new.isna().sum()

ID                         0
country                    0
age_group                  0
travel_with              608
total_female               3
total_male                 5
purpose                    0
main_activity              0
info_source                0
tour_arrangement           0
package_transport_int      0
package_accomodation       0
package_food               0
package_transport_tz       0
package_sightseeing        0
package_guided_tour        0
package_insurance          0
night_mainland             0
night_zanzibar             0
payment_mode               0
first_trip_tz              0
most_impressing          124
total_cost                 0
dtype: int64

In [265]:
'''now we removed the rest of the missing data
'''
df_new.dropna(inplace=True)
df_new.isna().sum()

ID                       0
country                  0
age_group                0
travel_with              0
total_female             0
total_male               0
purpose                  0
main_activity            0
info_source              0
tour_arrangement         0
package_transport_int    0
package_accomodation     0
package_food             0
package_transport_tz     0
package_sightseeing      0
package_guided_tour      0
package_insurance        0
night_mainland           0
night_zanzibar           0
payment_mode             0
first_trip_tz            0
most_impressing          0
total_cost               0
dtype: int64

In [266]:
'''new data
'''
df_new.shape

(2399, 23)

## Dealing with categorical variables

In the following we want to find out if the variables could be categorical or numeric. We will take a closer look at the columns `age-group`,`travel_with`, `purpose`, `info_source`, `tour_arrangement` and `main_activity`.

In [267]:
# Descriptive statistics for column age_group
print(df_new.age_group.describe())
print("Unique values in column age_group: ", df_new.age_group.unique())

count      2399
unique        4
top       25-44
freq       1060
Name: age_group, dtype: object
Unique values in column age_group:  ['45-64' '25-44' '1-24' '65+']

In [268]:
# Descriptive statistics for column travel_with
print(df_new.travel_with.describe())
print("Unique values in column travel_with: ", df_new.travel_with.unique())

count       2399
unique         5
top       Spouse
freq         817
Name: travel_with, dtype: object
Unique values in column travel_with:  ['Friends/Relatives' 'Alone' 'Spouse' 'Children' 'Spouse and Children']

In [269]:
# Descriptive statistics for column purpose
print(df_new.purpose.describe())
print("Unique values in column purpose: ", df_new.purpose.unique())

count                     2399
unique                       7
top       Leisure and Holidays
freq                      1971
Name: purpose, dtype: object
Unique values in column purpose:  ['Leisure and Holidays' 'Visiting Friends and Relatives' 'Business'
 'Scientific and Academic' 'Volunteering' 'Meetings and Conference'
 'Other']

In [270]:
# Descriptive statistics for column main_activity
print(df_new.main_activity.describe())
print("Unique values in column main_activity: ", df_new.main_activity.unique())

count                 2399
unique                   9
top       Wildlife tourism
freq                  1286
Name: main_activity, dtype: object
Unique values in column main_activity:  ['Wildlife tourism' 'Cultural tourism' 'Mountain climbing' 'Beach tourism'
 'Hunting tourism' 'business' 'Conference tourism' 'Bird watching'
 'Diving and Sport Fishing']

In [271]:
# Descriptive statistics for column info_source
print(df_new.info_source.describe())
print("Unique values in column info_source: ", df_new.info_source.unique())

count                             2399
unique                               8
top       Travel, agent, tour operator
freq                              1327
Name: info_source, dtype: object
Unique values in column info_source:  ['Friends, relatives' 'Travel, agent, tour operator' 'Radio, TV, Web'
 'Newspaper, magazines,brochures' 'others' 'Tanzania Mission Abroad'
 'Trade fair' 'inflight magazines']

In [272]:
# Descriptive statistics for column tour_arrangement
print(df_new.tour_arrangement.describe())
print("Unique values in column tour_arrangement: ", df_new.tour_arrangement.unique())

count             2399
unique               2
top       Package Tour
freq              1596
Name: tour_arrangement, dtype: object
Unique values in column tour_arrangement:  ['Independent' 'Package Tour']

It turns out that this columns are **categorical** variables, i.e. they represent categories, not numerical features.

We can see that `total_female`, `total_male`, `payment_mode` and `ID` variables isn't providing any information for our model, so we can drop them too.

In [273]:
df_new= df_new.drop(['total_female','total_male','payment_mode','ID'], axis=1)

## Transforming categorical variables

We want to use categorical variables in our regression model. Thus, they need to be transformed. To do so in the following we create dummy variables.

### Creating Dummy Variables

In [274]:
# Create dummy variables using pandas .get_dummies()
age_with_dummy = pd.get_dummies(df_new['age_group'], drop_first=True)
data_all = pd.concat([df_new,age_with_dummy],axis=1)

In [275]:
travel_with_dummy = pd.get_dummies(df_new['travel_with'], drop_first=True)
data_all1 = pd.concat([data_all,travel_with_dummy],axis=1)

In [276]:
purpose_with_dummy = pd.get_dummies(df_new['purpose'], drop_first=True)
data_all2 = pd.concat([data_all1,purpose_with_dummy],axis=1)

In [277]:
mainactivity_with_dummy = pd.get_dummies(df_new['main_activity'], drop_first=True)
data_all3 = pd.concat([data_all2,mainactivity_with_dummy],axis=1)

In [278]:
#info_with_dummy = pd.get_dummies(df_new['info_source'], drop_first=True)
#data_all4 = pd.concat([data_all3,info_with_dummy],axis=1)

In [279]:
#tourarr_with_dummy = pd.get_dummies(df_new['tour_arrangement'], drop_first=True)
#data_all5 = pd.concat([data_all4,tourarr_with_dummy],axis=1)

In [280]:
tourarr_with_dummy = pd.get_dummies(df_new['tour_arrangement'], drop_first=True)
data_all5 = pd.concat([data_all3,tourarr_with_dummy],axis=1)

In [281]:
# Drop original columns
data_all6= data_all5.drop(['age_group','travel_with','purpose','main_activity','info_source','tour_arrangement'], axis=1)

In [282]:
# Replace YES and NO in the dataset with 1 and 0
data_all7 = data_all6.replace({'Yes':1, 'No': 0})

In [283]:
data_all7.head()

,country,package_transport_int,package_accomodation,package_food,package_transport_tz,package_sightseeing,package_guided_tour,package_insurance,night_mainland,night_zanzibar,...,Volunteering,Bird watching,Conference tourism,Cultural tourism,Diving and Sport Fishing,Hunting tourism,Mountain climbing,Wildlife tourism,business,Package Tour
0,SWIZERLAND,0,0,0,0,0,0,0,13.0,0.0,...,0,0,0,0,0,0,0,1,0,0
2,UNITED KINGDOM,0,0,0,0,0,0,0,1.0,31.0,...,0,0,0,1,0,0,0,0,0,0
3,UNITED KINGDOM,0,1,1,1,1,1,0,11.0,0.0,...,0,0,0,0,0,0,0,1,0,1
6,SOUTH AFRICA,0,0,0,0,0,0,0,9.0,0.0,...,0,0,0,0,0,0,1,0,0,0
7,UNITED STATES OF AMERICA,1,1,1,1,1,1,1,10.0,3.0,...,0,0,0,0,0,0,0,1,0,1

In [284]:
data_all7.country = data_all7.country.astype('category')
data_all7.country = data_all7.country.cat.reorder_categories(['SWIZERLAND', 'UNITED KINGDOM', 'CHINA', 'DENMARK', 'UNITED STATES OF AMERICA', 'ITALY', 'FRANCE', 'AUSTRALIA', 'SOUTH AFRICA', 'GERMANY', 'SPAIN', 'CANADA', 'NETHERLANDS'], ordered=True)
data_all7.country = data_all7.country.cat.codes

print(data_all7.country.unique())
print(data_all7.country.value_counts())

[ 0  1  8  4 11  9  3 10  5  2 12  6  7]
4     510
1     387
5     351
6     237
9     183
8     156
7     151
10    125
11     87
12     86
0      51
2      49
3      26
Name: country, dtype: int64

In [285]:
data_all7.head()

,country,package_transport_int,package_accomodation,package_food,package_transport_tz,package_sightseeing,package_guided_tour,package_insurance,night_mainland,night_zanzibar,...,Volunteering,Bird watching,Conference tourism,Cultural tourism,Diving and Sport Fishing,Hunting tourism,Mountain climbing,Wildlife tourism,business,Package Tour
0,0,0,0,0,0,0,0,0,13.0,0.0,...,0,0,0,0,0,0,0,1,0,0
2,1,0,0,0,0,0,0,0,1.0,31.0,...,0,0,0,1,0,0,0,0,0,0
3,1,0,1,1,1,1,1,0,11.0,0.0,...,0,0,0,0,0,0,0,1,0,1
6,8,0,0,0,0,0,0,0,9.0,0.0,...,0,0,0,0,0,0,1,0,0,0
7,4,1,1,1,1,1,1,1,10.0,3.0,...,0,0,0,0,0,0,0,1,0,1

In [286]:
#data_all8 = data_all7.replace({'SWIZERLAND':1, 'UNITED KINGDOM': 2 ,'CHINA':3,'DENMARK':4,'UNITED STATES OF AMERICA':5,'ITALY':6,'FRANCE':7,'AUSTRALIA':8,'SOUTH AFRICA':9,'GERMANY':10,'SPAIN':11,'CANADA':12,'NETHERLANDS':13})

In [287]:
#data_all8.head(20)

## Removing outliers

In [288]:
###removing outliers Inter-quartile Range (IQR)
###IQR = Q3-Q1
###Lower Boundary = Q1-1.5*IQR
###Upper Boundary = Q3+1.5*IQR

def outliers(df,ft):
    Q1 = df[ft].quantile(0.25)
    Q3 = df[ft].quantile(0.75)
    IQR = Q3 - Q1

    lower_bound = Q1 - 1.5*IQR
    upper_bound = Q3 + 1.5*IQR

    ls = df.index[(df[ft] < lower_bound)| (df[ft] > upper_bound)]
    return ls

In [289]:
#create an empty list to store the output indices from multiple columns
index_list = []
for feature in ['night_mainland','night_zanzibar','total_cost']:
    index_list.extend(outliers(data_all7,feature))

In [290]:
def remove(df,ls):
    ls = sorted(set(ls))
    df = df.drop(ls)
    return df

In [291]:
df_cleaned =remove(data_all7,index_list)

In [292]:
df_cleaned.shape

(2138, 35)

In [293]:
df_cleaned.to_csv('new_cleaned.csv',index=False)

In [294]:
new_cleaned2 =pd.read_csv('new_cleaned.csv')

In [295]:
new_cleaned2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2138 entries, 0 to 2137
Data columns (total 35 columns):
 #   Column                          Non-Null Count  Dtype
---  ------                          --------------  -----
 0   country                         2138 non-null   int64
 1   package_transport_int           2138 non-null   int64
 2   package_accomodation            2138 non-null   int64
 3   package_food                    2138 non-null   int64
 4   package_transport_tz            2138 non-null   int64
 5   package_sightseeing             2138 non-null   int64
 6   package_guided_tour             2138 non-null   int64
 7   package_insurance               2138 non-null   int64
 8   night_mainland                  2138 non-null   float64
 9   night_zanzibar                  2138 non-null   float64
 10  first_trip_tz                   2138 non-null   int64
 11  most_impressing                 2138 non-null   object
 12  total_cost                      2138 non-null   float64
 13  25-44                           2138 non-null   int64
 14  45-64                           2138 non-null   int64
 15  65+                             2138 non-null   int64
 16  Children                        2138 non-null   int64
 17  Friends/Relatives               2138 non-null   int64
 18  Spouse                          2138 non-null   int64
 19  Spouse and Children             2138 non-null   int64
 20  Leisure and Holidays            2138 non-null   int64
 21  Meetings and Conference         2138 non-null   int64
 22  Other                           2138 non-null   int64
 23  Scientific and Academic         2138 non-null   int64
 24  Visiting Friends and Relatives  2138 non-null   int64
 25  Volunteering                    2138 non-null   int64
 26  Bird watching                   2138 non-null   int64
 27  Conference tourism              2138 non-null   int64
 28  Cultural tourism                2138 non-null   int64
 29  Diving and Sport Fishing        2138 non-null   int64
 30  Hunting tourism                 2138 non-null   int64
 31  Mountain climbing               2138 non-null   int64
 32  Wildlife tourism                2138 non-null   int64
 33  business                        2138 non-null   int64
 34  Package Tour                    2138 non-null   int64
dtypes: float64(3), int64(31), object(1)
memory usage: 584.7+ KB